Revit 2027 API
BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsWarning Property
 You have selected a mixture of modeling and view specific elements to array in an associative manner. Only the model elements will remain grouped and associative.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsWarning { get; }
Public Shared ReadOnly Property ArrayMixedModAndViewSpecElemsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArrayMixedModAndViewSpecElemsWarning {
	FailureDefinitionId^ get ();
}
static member ArrayMixedModAndViewSpecElemsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace